{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Phi3ForCausalLM",
    "parent_library": "transformers.models.phi3.modeling_phi3"
  },
  "base_model_name_or_path": "microsoft/Phi-3-mini-128k-instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "layers.31.self_attn.o_proj",
    "layers.30.self_attn.o_proj",
    "layers.27.self_attn.o_proj",
    "layers.26.self_attn.o_proj",
    "layers.28.self_attn.o_proj",
    "layers.28.self_attn.qkv_proj",
    "layers.29.self_attn.qkv_proj",
    "layers.27.self_attn.qkv_proj",
    "layers.30.self_attn.qkv_proj",
    "layers.29.self_attn.o_proj",
    "layers.26.self_attn.qkv_proj",
    "layers.31.self_attn.qkv_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}